renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_cellular/src/private/private_api/include/cellular_private_api.h
/*
 * Copyright (c) 2025 Renesas Electronics Corporation and/or its affiliates
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/**********************************************************************************************************************
 * File Name    : cellular_private_api.h
 * Description  : Configures the driver.
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Includes   <System Includes> , "Project Includes"
 *********************************************************************************************************************/
#include <stdint.h>
#include <stdbool.h>
#include "r_cellular_if.h"

#ifndef CELLULAR_PRIVATE_API_H
#define CELLULAR_PRIVATE_API_H

/**********************************************************************************************************************
 * Macro definitions
 *********************************************************************************************************************/
#ifndef CELLULAR_CFG_UART_SCI_CH
#error "Error! Need to define CELLULAR_CFG_UART_SCI_CH in cellular_config.h"
#elif CELLULAR_CFG_UART_SCI_CH == (0)
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
/* Store R_SCI_PinSet_SCI0() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI0())
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
/*  */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()
#endif
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH0)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH0_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH0_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (1)
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
/* Store R_SCI_PinSet_SCI1() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI1())
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
/* Emptying R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()
#endif
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH1)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH1_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH1_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (2)
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
/* Store R_SCI_PinSet_SCI2() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI2())
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
/* Emptying R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()
#endif
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH2)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH2_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH2_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (3)
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
/* Store R_SCI_PinSet_SCI3() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI3())
#elif defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
/* Emptying R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()
#endif
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH3)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH3_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH3_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (4)
/* Store R_SCI_PinSet_SCI4() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI4())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH4)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH4_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH4_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (5)
/* Store R_SCI_PinSet_SCI5() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI5())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH5)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH5_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH5_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (6)
/* Store R_SCI_PinSet_SCI6() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI6())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH6)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH6_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH6_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (7)
/* Store R_SCI_PinSet_SCI7() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI7())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH7)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH7_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH7_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (8)
/* Store R_SCI_PinSet_SCI8() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI8())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH8)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH8_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH8_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (9)
/* Store R_SCI_PinSet_SCI9() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI9())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH9)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH9_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH9_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (10)
/* Store R_SCI_PinSet_SCI10() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI10())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH10)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH10_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH10_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (11)
/* Store R_SCI_PinSet_SCI11() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI11())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH11)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH11_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH11_RX_BUFSIZ)
#elif CELLULAR_CFG_UART_SCI_CH == (12)
/* Store R_SCI_PinSet_SCI12() in R_SCI_CFG_PINSET_CELLULAR_SERIAL() */
#define R_SCI_CFG_PINSET_CELLULAR_SERIAL()      (R_SCI_PinSet_SCI12())
#define R_SCI_CFG_CELLULAR_SERIAL_CH            (SCI_CH12)
#define R_SCI_CFG_TX_BUFSIZE                    (SCI_CFG_CH12_TX_BUFSIZ)
#define R_SCI_CFG_RX_BUFSIZE                    (SCI_CFG_CH12_RX_BUFSIZ)
#else
#error "Error! Invalid setting for CELLULAR_UART_SCI_CH in cellular_config.h"
#endif /* CELLULAR_CFG_UART_SCI_CH */

#if R_SCI_CFG_TX_BUFSIZE < (2048)
#error "The SCI send buffer size is too small."
#endif
#if R_SCI_CFG_RX_BUFSIZE < (2048)
#error "The SCI receive buffer size is too small."
#endif
#if BSP_CFG_RTOS_USED == (1)
#if CELLULAR_CFG_SCI_PRIORITY > configMAX_SYSCALL_INTERRUPT_PRIORITY
#error "SCI interrupt priority is outside the control of the FreeRTOS."
#endif
#endif

/**********************************************************************************************************************
 * Exported global variables
 *********************************************************************************************************************/
extern st_cellular_ctrl_t * gp_cellular_ctrl;

/*****************************************************************************
 * Private Functions
 *****************************************************************************/
/****************************************************************************
 * Function Name  @fn            cellular_power_down
 * Description    @details       Stop the power supply to the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully initialized the serial communication function.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***************************************************************************/
e_cellular_err_t cellular_power_down (st_cellular_ctrl_t * const p_ctrl);

/**********************************************************************************************
 * Function Name  @fn            cellular_serial_open
 * Description    @details       Initializing the serial communication function.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully initialized the serial communication function.
 *                @retval        CELLULAR_ERR_SERIAL_OPEN -
 *                                  Serial initialization failed.
 *********************************************************************************************/
e_cellular_err_t cellular_serial_open (st_cellular_ctrl_t * const p_ctrl);

/**********************************************************************************************
 * Function Name  @fn            cellular_serial_close
 * Description    @details       Terminate the serial communication function.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *********************************************************************************************/
void cellular_serial_close (st_cellular_ctrl_t * const p_ctrl);

/****************************************************************************
 * Function Name  @fn            cellular_semaphore_init
 * Description    @details       Initialize the semaphore function.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully semaphore initialization.
 *                @retval        CELLULAR_ERR_SEMAPHORE_INIT -
 *                                  Failed to initialize the semaphore.
 ***************************************************************************/
e_cellular_err_t cellular_semaphore_init (st_cellular_ctrl_t * const p_ctrl);

/****************************************************************************
 * Function Name  @fn            cellular_socket_init
 * Description    @details       Send AT command to the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully Socket initialization.
 *                @retval        CELLULAR_ERR_BYTEQ_OPEN -
 *                                  Failed to initialize the byte queue.
 ***************************************************************************/
e_cellular_err_t cellular_socket_init (st_cellular_ctrl_t * const p_ctrl);

