renesas/iot-reference-rx/Projects/test_aws_ryz014a_ck_rx65n_v2/e2studio_ccrx/src/smc_gen/r_cellular/src/private/private_api/include/cellular_private_api.h
/*******************************************************************************
 * Function Name  @fn            cellular_timeout_init
 * Description    @details       Set the communication timeout with the module.
 * Arguments      @param[in/out] p_timeout_ctrl -
 *                                  Pointer to the timeout management structure.
 *                @param[in]     timeout_ms -
 *                                  Timeout millisecond.
 ******************************************************************************/
void cellular_timeout_init (st_cellular_time_ctrl_t * const p_timeout_ctrl, const uint32_t timeout_ms);

/*******************************************************************************
 * Function Name  @fn            cellular_check_timeout
 * Description    @details       Check the timeout.
 * Arguments      @param[in/out] p_timeout_ctrl -
 *                                  Pointer to the timeout management structure.
 * Return Value   @retval        CELLULAR_NOT_TIMEOUT -
 *                                  No timeout occurred.
 *                @retval        CELLULAR_TIMEOUT; -
 *                                  Timeout occurs.
 ******************************************************************************/
e_cellular_timeout_check_t cellular_check_timeout (st_cellular_time_ctrl_t * const p_timeout_ctrl);

/************************************************************************
 * Function Name  @fn            cellular_shutdownsocket
 * Description    @details       Disconnect the socket connection.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_no -
 *                                  Number to close socket.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully disconnected the socket connection.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t cellular_shutdownsocket (st_cellular_ctrl_t * const p_ctrl, const uint8_t socket_no);

/************************************************************************
 * Function Name  @fn            cellular_closesocket
 * Description    @details       Close the socket.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     socket_no -
 *                                  Number to close socket.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully closed the socket.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ***********************************************************************/
e_cellular_err_t cellular_closesocket (st_cellular_ctrl_t * const p_ctrl, const uint8_t socket_no);

/*******************************************************************************
 * Function Name  @fn            cellular_disconnect
 * Description    @details       Disconnect from the access point.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully disconnected from access point.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 *                @retval        CELLULAR_ERR_OTHER_ATCOMMAND_RUNNING -
 *                                  Other AT commands are running.
 ******************************************************************************/
e_cellular_err_t cellular_disconnect (st_cellular_ctrl_t * const p_ctrl);

/*******************************************************************************
 * Function Name  @fn            cellular_module_reset
 * Description    @details       Reset the module.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully disconnected from access point.
 *                @retval        CELLULAR_ERR_MODULE_COM -
 *                                  Communication with module failed.
 ******************************************************************************/
e_cellular_err_t cellular_module_reset (st_cellular_ctrl_t * const p_ctrl);

/**********************************************************************************************
 * Function Name  @fn            cellular_irq_open
 * Description    @details       Initializing the external terminal interrupt function.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully initialized the serial communication function.
 *                @retval        CELLULAR_ERR_IRQ_OPEN -
 *                                  IRQ initialization failed.
 *********************************************************************************************/
e_cellular_err_t cellular_irq_open (st_cellular_ctrl_t * const p_ctrl);

/**********************************************************************************************
 * Function Name  @fn            cellular_psm_config
 * Description    @details       Initializing the external terminal interrupt function.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *                @param[in]     mode -
 *                                  PSM mode setting.
 * Return Value   @retval        CELLULAR_SUCCESS -
 *                                  Successfully initialized the serial communication function.
 *                @retval        CELLULAR_ERR_IRQ_OPEN -
 *                                  IRQ initialization failed.
 *********************************************************************************************/
e_cellular_err_t cellular_psm_config (st_cellular_ctrl_t * const p_ctrl, const e_cellular_psm_mode_t mode);

/**********************************************************************************************
 * Function Name  @fn            cellular_irq_close
 * Description    @details       Terminate the external terminal interrupt function.
 * Arguments      @param[in/out] p_ctrl -
 *                                  Pointer to managed structure.
 *********************************************************************************************/
void cellular_irq_close (st_cellular_ctrl_t * const p_ctrl);

